ERP/src/InformationRegisters/ПланВыставленияСчетовНаПродлениеПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПланВыставленияСчетовНаПродлениеПодписки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПодписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаПодписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодОбновления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Подписка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/CommonModules/ОплатаПодписки_ВызовСервера/Ext/Module.bsl
Функция ПолучитьКрайнийСрокОплаты(ВремяНаОплату = Неопределено, ДатаНачала = Неопределено)
		
	Если ДатаНачала = Неопределено Тогда
		
		ДатаНачала = ТекущаяДата();	
		
	КонецЕсли;
	
	Возврат ДатаНачала + Константы.КрайнийСрокОплатыПодпискиВДнях.ВСекундах();
	
КонецФункции

Процедура ЗавершениеПервойОплаты(Счет) Экспорт
	
	Документы.ВнесениеОплаты.СформироватьОплатуНаОснованииСчета(Счет);
	Счет.Подписка.Активировать();	
	РегистрыСведений.ПланВыставленияСчетовНаПродлениеПодписки.ЗапланироватьСледующуюОплату(Счет.Подписка);
	Документы.ПартнерскийКонтракт.СформироватьНаОснованииПодписки(Счет.Подписка);
	
КонецПроцедуры
